<a href="https://colab.research.google.com/github/DishaBalpande/PyScrape_Assignment/blob/master/Disha_PyScrape.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
from bs4 import BeautifulSoup as soup
import re
import requests
import pandas as pd

In [0]:
url = "https://www.mysmartprice.com/mobile/pricelist/samsung-mobile-price-list-in-india.html"

In [0]:
html = requests.get(url)
bs = soup(html.text,'html.parser')
html.close()

In [0]:
li_class = bs.find_all('li',{'class':"prdct-item clearfix card"})

In [0]:
data = []
l = bs.find('a',{'class' : "pgntn__item",'data-pgno':"2"},'Next')
for j in range(6):
    html = requests.get(url)
    bs = soup(html.text,'html.parser')
    html.close()
    li_class = bs.find_all('li',{'class':"prdct-item clearfix card"})
    data1 = []
    for i in range(len(li_class)):
        model = li_class[i].find('a',{"class":"prdct-item__name"}).get_text()
        price = li_class[i].find("span",{"class":"prdct-item__prc-val"}).get_text()
        data1.append((model, price))

    l = bs.findAll("a",{'class' : 'pgntn__item','data-pgno':"2"},"Next")[-1]
    url = l["href"]
    data.extend(data1)

In [0]:
result =  pd.DataFrame(data,columns = ("Phone_Name","Price"))

In [15]:
result.head()

              Phone_Name   Price
0    Samsung Galaxy A50   12,999
1   Samsung Galaxy M30s   12,999
2    Samsung Galaxy A30   12,999
3    Samsung Galaxy M30   11,999
4    Samsung Galaxy A10    7,990

In [0]:
result.to_csv("Disha_PyScrape.csv",index = False)